In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
s = pd.Series([1,3,5,np.nan,6,8])
# Series? -> 정수 index값을 기본적으로 포함한 1차원 자료배열
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
s.values
# series의 값만 확인
s = pd.Series([1,3,6,8], index=['a','b','c','d'])
# series 값/인덱스 변경 O
s

a    1
b    3
c    6
d    8
dtype: int64

In [4]:
dates = pd.date_range('20200101', periods=6)
dates

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2020-01-01 -1.334751 -0.263100 -1.221713  0.996185
2020-01-02  1.292449  0.596256 -1.495823 -0.449309
2020-01-03  1.062698  1.580715  1.319954 -0.536290
2020-01-04  0.990216  0.875555  0.069432 -0.340926
2020-01-05  1.608930  1.165134 -0.529720  0.458670
2020-01-06 -0.775167  0.145184  1.646481  0.647393

In [6]:
df2 = pd.DataFrame({'A' : 1.0,
                   'B' : pd.Timestamp('20200102'),
                    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                    'D' : np.array([3]*4,dtype='int32'),
                    'E' : pd.Categorical(["test","train","test","train"]),
                    'F' : 'foo'
                   })
df2

     A          B    C  D      E    F
0  1.0 2020-01-02  1.0  3   test  foo
1  1.0 2020-01-02  1.0  3  train  foo
2  1.0 2020-01-02  1.0  3   test  foo
3  1.0 2020-01-02  1.0  3  train  foo

In [7]:
df2.dtypes
# 결과물의 데이터 타입 확인

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [8]:
df.tail(3)
# 끝에서 마지막 3줄
df.head(3)
# 위에서 처음 3줄

                   A         B         C         D
2020-01-01 -1.334751 -0.263100 -1.221713  0.996185
2020-01-02  1.292449  0.596256 -1.495823 -0.449309
2020-01-03  1.062698  1.580715  1.319954 -0.536290

In [9]:
df.index
# index , 열column , numpy데이터 세부정보

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df.describe()
# 대략적 통계 정보

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.474062  0.683291 -0.035231  0.129287
std    1.216796  0.673394  1.300863  0.652274
min   -1.334751 -0.263100 -1.495823 -0.536290
25%   -0.333821  0.257952 -1.048715 -0.422213
50%    1.026457  0.735906 -0.230144  0.058872
75%    1.235011  1.092739  1.007324  0.600212
max    1.608930  1.580715  1.646481  0.996185

In [11]:
df.T
# 데이터 전치 -> index와 column 뒤바꿈

   2020-01-01  2020-01-02  2020-01-03  2020-01-04  2020-01-05  2020-01-06
A   -1.334751    1.292449    1.062698    0.990216    1.608930   -0.775167
B   -0.263100    0.596256    1.580715    0.875555    1.165134    0.145184
C   -1.221713   -1.495823    1.319954    0.069432   -0.529720    1.646481
D    0.996185   -0.449309   -0.536290   -0.340926    0.458670    0.647393

In [12]:
df.sort_index(axis=1, ascending=False)
# 축별로 정렬

                   D         C         B         A
2020-01-01  0.996185 -1.221713 -0.263100 -1.334751
2020-01-02 -0.449309 -1.495823  0.596256  1.292449
2020-01-03 -0.536290  1.319954  1.580715  1.062698
2020-01-04 -0.340926  0.069432  0.875555  0.990216
2020-01-05  0.458670 -0.529720  1.165134  1.608930
2020-01-06  0.647393  1.646481  0.145184 -0.775167

In [13]:
df.sort_values(by='B')
# 값별로 정렬 -> 지금은 B의 데이터가 작은 순서대로 배열

                   A         B         C         D
2020-01-01 -1.334751 -0.263100 -1.221713  0.996185
2020-01-06 -0.775167  0.145184  1.646481  0.647393
2020-01-02  1.292449  0.596256 -1.495823 -0.449309
2020-01-04  0.990216  0.875555  0.069432 -0.340926
2020-01-05  1.608930  1.165134 -0.529720  0.458670
2020-01-03  1.062698  1.580715  1.319954 -0.536290

In [14]:
df['A']
# Getting데이터얻기 -> df.A와 동일한 Series 생성하는 단일 열 선택

2020-01-01   -1.334751
2020-01-02    1.292449
2020-01-03    1.062698
2020-01-04    0.990216
2020-01-05    1.608930
2020-01-06   -0.775167
Freq: D, Name: A, dtype: float64

In [15]:
df[0:3]
# [] -> 행 분할

                   A         B         C         D
2020-01-01 -1.334751 -0.263100 -1.221713  0.996185
2020-01-02  1.292449  0.596256 -1.495823 -0.449309
2020-01-03  1.062698  1.580715  1.319954 -0.536290

In [16]:
df['20200101':'20200103']

                   A         B         C         D
2020-01-01 -1.334751 -0.263100 -1.221713  0.996185
2020-01-02  1.292449  0.596256 -1.495823 -0.449309
2020-01-03  1.062698  1.580715  1.319954 -0.536290

In [17]:
df.loc[dates[0]]
# Label통한 선택 -> 횡단면 획득(0번째 dates의 값 얻어옴)

A   -1.334751
B   -0.263100
C   -1.221713
D    0.996185
Name: 2020-01-01 00:00:00, dtype: float64

In [18]:
df.loc[:,['A','B']]
# : -> index축은 전체 , A B 축만 얻어옴
# df.loc[dates[0],['A','B']] -> 0번째 date
# df.loc['20200102':'20200104', ['A','B']] -> index축 & A,B 축 얻어옴

                   A         B
2020-01-01 -1.334751 -0.263100
2020-01-02  1.292449  0.596256
2020-01-03  1.062698  1.580715
2020-01-04  0.990216  0.875555
2020-01-05  1.608930  1.165134
2020-01-06 -0.775167  0.145184

In [19]:
df.loc['20200101',['A','B']]
# 단일 차원 객체 반환

A   -1.334751
B   -0.263100
Name: 2020-01-01 00:00:00, dtype: float64

In [20]:
df.loc[dates[0],'A']
# 스칼라값(하나의 값인듯)
# = df.at[dates[0],'A'] (<- 더 빠른 연산 O)

-1.3347512716659944

In [21]:
df

                   A         B         C         D
2020-01-01 -1.334751 -0.263100 -1.221713  0.996185
2020-01-02  1.292449  0.596256 -1.495823 -0.449309
2020-01-03  1.062698  1.580715  1.319954 -0.536290
2020-01-04  0.990216  0.875555  0.069432 -0.340926
2020-01-05  1.608930  1.165134 -0.529720  0.458670
2020-01-06 -0.775167  0.145184  1.646481  0.647393

In [22]:
df.iloc[3]
# 위치로 선택 -> 넘겨받은 위치(3번째줄)를 기준으로 선택

A    0.990216
B    0.875555
C    0.069432
D   -0.340926
Name: 2020-01-04 00:00:00, dtype: float64

In [23]:
df.iloc[3:5,0:2]
# 3:5 -> 3~4! (맨 마지막은 포함X)
# 0:2 -> 마찬가지

                   A         B
2020-01-04  0.990216  0.875555
2020-01-05  1.608930  1.165134

In [24]:
df.iloc[1:3,:]
# 행 나누기(열은 : = 그대로 있어라~)
df.iloc[:,1:3]
# 열 나누기

                   B         C
2020-01-01 -0.263100 -1.221713
2020-01-02  0.596256 -1.495823
2020-01-03  1.580715  1.319954
2020-01-04  0.875555  0.069432
2020-01-05  1.165134 -0.529720
2020-01-06  0.145184  1.646481

In [25]:
df.iloc[1,1]
# 명시적으로 값 얻기
# 마찬가지 df.iat[1,1] -> 빠른 연산

0.5962564193099403

In [26]:
df[df.A>0]
# A 데이터를 기준, 0보다 큰 녀석들만 보여줌

                   A         B         C         D
2020-01-02  1.292449  0.596256 -1.495823 -0.449309
2020-01-03  1.062698  1.580715  1.319954 -0.536290
2020-01-04  0.990216  0.875555  0.069432 -0.340926
2020-01-05  1.608930  1.165134 -0.529720  0.458670

In [27]:
df[df>0]
# Boolean조건 충족하는 데이터프레임 값 추출

                   A         B         C         D
2020-01-01       NaN       NaN       NaN  0.996185
2020-01-02  1.292449  0.596256       NaN       NaN
2020-01-03  1.062698  1.580715  1.319954       NaN
2020-01-04  0.990216  0.875555  0.069432       NaN
2020-01-05  1.608930  1.165134       NaN  0.458670
2020-01-06       NaN  0.145184  1.646481  0.647393

In [28]:
df2 = df.copy()
df2['E'] = ['one','one','two','three','four','three']
df2

                   A         B         C         D      E
2020-01-01 -1.334751 -0.263100 -1.221713  0.996185    one
2020-01-02  1.292449  0.596256 -1.495823 -0.449309    one
2020-01-03  1.062698  1.580715  1.319954 -0.536290    two
2020-01-04  0.990216  0.875555  0.069432 -0.340926  three
2020-01-05  1.608930  1.165134 -0.529720  0.458670   four
2020-01-06 -0.775167  0.145184  1.646481  0.647393  three

In [29]:
df2[df2['E'].isin(['two','four'])]
# 필터링을 위한 메소드 isin() -> 해당 값만 불러옴

                   A         B         C        D     E
2020-01-03  1.062698  1.580715  1.319954 -0.53629   two
2020-01-05  1.608930  1.165134 -0.529720  0.45867  four

In [30]:
# 새로운 열 설정
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20200101',periods=6))
s1

2020-01-01    1
2020-01-02    2
2020-01-03    3
2020-01-04    4
2020-01-05    5
2020-01-06    6
Freq: D, dtype: int64

In [31]:
df['F'] = s1
df

                   A         B         C         D  F
2020-01-01 -1.334751 -0.263100 -1.221713  0.996185  1
2020-01-02  1.292449  0.596256 -1.495823 -0.449309  2
2020-01-03  1.062698  1.580715  1.319954 -0.536290  3
2020-01-04  0.990216  0.875555  0.069432 -0.340926  4
2020-01-05  1.608930  1.165134 -0.529720  0.458670  5
2020-01-06 -0.775167  0.145184  1.646481  0.647393  6

In [32]:
df.iat[0,1] = 0
# 위치 통해 값 설정
df.at[dates[0],'A'] = 0
# 라벨 통해 값 설정
df.loc[:,'D'] = np.array([5]*len(df))
# Numpy 배열 사용한 할당 - ?
# np.array()
df

                   A         B         C  D  F
2020-01-01  0.000000  0.000000 -1.221713  5  1
2020-01-02  1.292449  0.596256 -1.495823  5  2
2020-01-03  1.062698  1.580715  1.319954  5  3
2020-01-04  0.990216  0.875555  0.069432  5  4
2020-01-05  1.608930  1.165134 -0.529720  5  5
2020-01-06 -0.775167  0.145184  1.646481  5  6

In [33]:
df2 = df.copy()
df2[df2>0] = -df2
df2

                   A         B         C  D  F
2020-01-01  0.000000  0.000000 -1.221713 -5 -1
2020-01-02 -1.292449 -0.596256 -1.495823 -5 -2
2020-01-03 -1.062698 -1.580715 -1.319954 -5 -3
2020-01-04 -0.990216 -0.875555 -0.069432 -5 -4
2020-01-05 -1.608930 -1.165134 -0.529720 -5 -5
2020-01-06 -0.775167 -0.145184 -1.646481 -5 -6

In [34]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
# reindex -> 지정된 축 상 인덱스를 변경/추가/삭제 O
df1.loc[dates[0]:dates[1],'E'] = 1
df1

                   A         B         C  D  F    E
2020-01-01  0.000000  0.000000 -1.221713  5  1  1.0
2020-01-02  1.292449  0.596256 -1.495823  5  2  1.0
2020-01-03  1.062698  1.580715  1.319954  5  3  NaN
2020-01-04  0.990216  0.875555  0.069432  5  4  NaN

In [35]:
df1.dropna(how='any')
#  값 없는 행 삭제

                   A         B         C  D  F    E
2020-01-01  0.000000  0.000000 -1.221713  5  1  1.0
2020-01-02  1.292449  0.596256 -1.495823  5  2  1.0

In [36]:
df1.fillna(value=5)
# 결측치 채워넣음

                   A         B         C  D  F    E
2020-01-01  0.000000  0.000000 -1.221713  5  1  1.0
2020-01-02  1.292449  0.596256 -1.495823  5  2  1.0
2020-01-03  1.062698  1.580715  1.319954  5  3  5.0
2020-01-04  0.990216  0.875555  0.069432  5  4  5.0

In [37]:
pd.isna(df1)
# nan인 값에만 True표시

                A      B      C      D      F      E
2020-01-01  False  False  False  False  False  False
2020-01-02  False  False  False  False  False  False
2020-01-03  False  False  False  False  False   True
2020-01-04  False  False  False  False  False   True

In [38]:
df

                   A         B         C  D  F
2020-01-01  0.000000  0.000000 -1.221713  5  1
2020-01-02  1.292449  0.596256 -1.495823  5  2
2020-01-03  1.062698  1.580715  1.319954  5  3
2020-01-04  0.990216  0.875555  0.069432  5  4
2020-01-05  1.608930  1.165134 -0.529720  5  5
2020-01-06 -0.775167  0.145184  1.646481  5  6

In [39]:
df.mean()
# .mean() -> 평균 구하는 함수

A    0.696521
B    0.727141
C   -0.035231
D    5.000000
F    3.500000
dtype: float64

In [40]:
df.mean(1)
# 1번 축에서 실행

2020-01-01    0.955657
2020-01-02    1.478577
2020-01-03    2.392673
2020-01-04    2.187041
2020-01-05    2.448869
2020-01-06    2.403300
Freq: D, dtype: float64

In [41]:
s = pd.Series([1,3,5,np.nan,6,8],index=dates).shift(2)
# series(data,index)로 데이터배열 생성
# shift(2)로 데이터값 두칸씩 이동
s

2020-01-01    NaN
2020-01-02    NaN
2020-01-03    1.0
2020-01-04    3.0
2020-01-05    5.0
2020-01-06    NaN
Freq: D, dtype: float64

In [42]:
df.sub(s, axis=0)
# sub(빼기) / add(더하기) -> 행에 대한 연산
# 평균계산 등을 할때 축axis 지정!
# axis=0 -> index기준 / axis=1 -> columns기준

                   A         B         C    D    F
2020-01-01       NaN       NaN       NaN  NaN  NaN
2020-01-02       NaN       NaN       NaN  NaN  NaN
2020-01-03  0.062698  0.580715  0.319954  4.0  2.0
2020-01-04 -2.009784 -2.124445 -2.930568  2.0  1.0
2020-01-05 -3.391070 -3.834866 -5.529720  0.0  0.0
2020-01-06       NaN       NaN       NaN  NaN  NaN

In [43]:
df.apply(np.cumsum)
# cumsum -> 배열에서 주어진 축 따라 누적되는 원소들의 누적 합

                   A         B         C   D   F
2020-01-01  0.000000  0.000000 -1.221713   5   1
2020-01-02  1.292449  0.596256 -2.717535  10   3
2020-01-03  2.355147  2.176971 -1.397581  15   6
2020-01-04  3.345363  3.052526 -1.328149  20  10
2020-01-05  4.954293  4.217660 -1.857869  25  15
2020-01-06  4.179126  4.362845 -0.211389  30  21

In [44]:
s = pd.Series(np.random.randint(0,7,size=10))
s

0    4
1    6
2    4
3    0
4    6
5    3
6    0
7    5
8    1
9    3
dtype: int32

In [45]:
s.value_counts()

6    2
4    2
3    2
0    2
5    1
1    1
dtype: int64

In [46]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s.str.lower()
# 소문자 변경함수 lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [47]:
df = pd.DataFrame(np.random.randn(10,4))
df

          0         1         2         3
0 -0.683972 -1.330907 -0.160163  0.652372
1 -0.619903  0.986976  0.845614 -0.192327
2 -1.699359 -0.031193 -0.662869  1.273812
3 -0.347773 -2.309610  1.054232 -1.185456
4 -1.733271  1.013213  0.863979 -0.574112
5 -3.059657 -0.816177 -1.569149  0.216055
6 -1.027894 -0.054803  1.068102 -0.366963
7  0.506517 -0.034226  0.770253  0.757617
8 -0.295046  0.013173 -0.099283  0.685342
9  0.394865  0.395191 -0.429663  0.738370

In [48]:
pieces = [df[:3], df[3:7], df[7:]]
pd.concat(pieces)

          0         1         2         3
0 -0.683972 -1.330907 -0.160163  0.652372
1 -0.619903  0.986976  0.845614 -0.192327
2 -1.699359 -0.031193 -0.662869  1.273812
3 -0.347773 -2.309610  1.054232 -1.185456
4 -1.733271  1.013213  0.863979 -0.574112
5 -3.059657 -0.816177 -1.569149  0.216055
6 -1.027894 -0.054803  1.068102 -0.366963
7  0.506517 -0.034226  0.770253  0.757617
8 -0.295046  0.013173 -0.099283  0.685342
9  0.394865  0.395191 -0.429663  0.738370

In [49]:
left = pd.DataFrame({'key':['foo','bar'], 'lval':[1,2]})
right = pd.DataFrame({'key':['foo','bar'], 'rval':[4,5]})
left

   key  lval
0  foo     1
1  bar     2

In [50]:
right

   key  rval
0  foo     4
1  bar     5

In [53]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [62]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])
df

          A         B         C         D
0  0.324813  0.715906  0.187764  0.772507
1 -1.109961  0.977975 -0.864986 -1.113699
2  0.514905  0.612650  1.247648  0.997196
3  0.366400 -1.291420 -1.668127  0.536353
4  0.576254  0.422373 -0.755369  1.043766
5  0.035847  1.559289 -0.317527 -0.008719
6  0.885714 -1.664695  1.607415  1.254711
7  0.772914  1.208510 -2.845370 -0.337066

In [65]:
s = df.iloc[3]
df.append(s, ignore_index=True)
# ingore_index통해 iloc으로 가져온 index(3번)를 무시하고, 순서대로 index 배열

          A         B         C         D
0  0.324813  0.715906  0.187764  0.772507
1 -1.109961  0.977975 -0.864986 -1.113699
2  0.514905  0.612650  1.247648  0.997196
3  0.366400 -1.291420 -1.668127  0.536353
4  0.576254  0.422373 -0.755369  1.043766
5  0.035847  1.559289 -0.317527 -0.008719
6  0.885714 -1.664695  1.607415  1.254711
7  0.772914  1.208510 -2.845370 -0.337066
8  0.366400 -1.291420 -1.668127  0.536353

In [68]:
df = pd.DataFrame(
    {
        'A' : ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'],
        'B' : ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
        'C' : np.random.randn(8),
        'D' : np.random.randn(8)
    })
df

     A      B         C         D
0  foo    one -0.199136 -0.176027
1  bar    one -1.374336  1.290317
2  foo    two -1.318043  0.395767
3  bar  three -1.139684  1.442944
4  foo    two -0.537626  0.490425
5  bar    two -1.687202  0.027036
6  foo    one -0.277781  0.775119
7  foo  three  0.246126 -0.065386

In [69]:
df.groupby('A').sum()
# A를 기준으로 그룹화! -> 각 그룹에 sum()적용

            C         D
A
bar -4.201221  2.760298
foo -2.086460  1.419898

In [72]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one   -1.374336  1.290317
    three -1.139684  1.442944
    two   -1.687202  0.027036
foo one   -0.476917  0.599092
    three  0.246126 -0.065386
    two   -1.855669  0.886192

In [80]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz','foo', 'foo', 'qux', 'qux'],
                    ['one', 'two', 'one', 'two','one', 'two', 'one', 'two']]))
# tuples -> 두 list인자들을 순서대로 묶은 배열을 인자로 가지는 list
index = pd.MultiIndex.from_tuples(tuples, names=['first','second'])
df = pd.DataFrame(np.random.randn(8,2), index = index, columns=['A','B'])
df

                     A         B
first second
bar   one    -0.291794  0.398210
      two    -0.579627  0.020680
baz   one    -1.818908 -0.969403
      two     0.151811  1.098639
foo   one     0.766795  0.873362
      two    -1.467768 -0.413153
qux   one    -0.128323  1.411276
      two    -0.557842 -0.716716

In [81]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz','foo', 'foo', 'qux', 'qux'],
                    ['one', 'two', 'one', 'two','one', 'two', 'one', 'two']]))
# tuples -> 두 list인자들을 순서대로 묶은 배열을 인자로 가지는 list
index = pd.MultiIndex.from_tuples(tuples, names=['first','second'])
df = pd.DataFrame(np.random.randn(8,2), index = index, columns=['A','B'])
df
df2 = df[:4]
# df를 위에서 4번째 까지 자르자!
df2

                     A         B
first second
bar   one     0.284039  1.330184
      two    -0.253172 -0.441268
baz   one    -0.368558 -0.919343
      two    -0.153763  0.102222

In [82]:
stacked = df2.stack()
# stack() -> 데이터프레임 열 계층 압축
stacked

first  second
bar    one     A    0.284039
               B    1.330184
       two     A   -0.253172
               B   -0.441268
baz    one     A   -0.368558
               B   -0.919343
       two     A   -0.153763
               B    0.102222
dtype: float64

In [89]:
stacked.unstack(1)
# stacked -> stack된! 가장 마지막 stack 데이터프레임 가져옴
# unstacked(0) -> index와 column 위치 대칭 이동

second        one       two
first
bar   A  0.284039 -0.253172
      B  1.330184 -0.441268
baz   A -0.368558 -0.153763
      B -0.919343  0.102222

In [93]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
                   'B' : ['A', 'B', 'C'] * 4,
                   'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                   'D' : np.random.randn(12),
                   'E' : np.random.randn(12)})
df

        A  B    C         D         E
0     one  A  foo -0.062752  0.120142
1     one  B  foo  0.089009  1.288544
2     two  C  foo  1.740067 -1.411870
3   three  A  bar  0.090276  0.000336
4     one  B  bar -0.789502  0.361073
5     one  C  bar -1.158060  0.921460
6     two  A  foo -1.126874  0.204674
7   three  B  foo -1.170041 -0.314869
8     one  C  foo -0.939050  0.424548
9     one  A  bar  0.537987  0.457373
10    two  B  bar -0.920172  0.644707
11  three  C  bar -1.110873  0.873198

In [99]:
pd.pivot_table(df, values='D', index=['A','B'], columns=['C'])
# 대박편리 !
# pivot_table() ->> index를 데이터 내부 값으로 변경할 수 있다고 생각하자
# multiindex - 외부에서 가져온 값으로 index로 생각하면 될 듯

C             bar       foo
A     B
one   A  0.537987 -0.062752
      B -0.789502  0.089009
      C -1.158060 -0.939050
three A  0.090276       NaN
      B       NaN -1.170041
      C -1.110873       NaN
two   A       NaN -1.126874
      B -0.920172       NaN
      C       NaN  1.740067

In [104]:
df = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a','b','b','a','a','e']})
df

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

In [105]:
df = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a','b','b','a','a','e']})
df
df["grade"] = df["raw_grade"].astype("category")
# astype("category") -> 가공X 데이터를 범주형 데이터로 변환
df["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): [a, b, e]

In [108]:
df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium", "good", "very good"])
# Series.cat.categories로 범주에 더 의미있는 이름 할당
df["grade"]

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (5, object): [very bad, bad, medium, good, very good]

In [109]:
df.sort_values(by="grade")

   id raw_grade      grade
5   6         e   very bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good
4   5         a  very good

In [110]:
df.groupby("grade").size()

grade
very bad     1
bad          0
medium       0
good         2
very good    3
dtype: int64

In [ ]:
# --그래프 앞까지---